// Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.
// 3 -> 1, 8, 27
// 5 -> 1, 8, 27, 64, 125

Console.Write("Введите число ");
int num = Convert.ToInt32(Console.ReadLine());
double result;
Console.WriteLine($"Таблица кубов числа {num}:");

for(double i=1; i<=num; i++)

{
  result=Math.Pow(i,3);
  Console.WriteLine(result);
}

// Math.Pow() – возведения числа в степень.
// В аргументных скобках через запятую указываются два аргумента (1-ый аргумент - число, которое возводим в степень,
// 2-ой – степень, в которую возводим число).